print('车次\t出发站-到达站\t出发时间\t到达时间\t历时\nT40\t长春-北京\t00:12\t\t12:20\t\t12:08\nT298\t长春-北京\t00:06\t\t10:50\t\t10:44\nZ158\t长春-北京\t12:48\t\t21:06\t\t08:18\nZ62\t长春-北京\t21:58\t\t06:08\t\t8:20')
car = input('请输入要购买的车次:')
man = input('请输入乘车人(用逗号分隔):')
if car == 'T40':
    print('您已购%s次列车\t长春到北京\t00:12开\t请%s尽快换取纸质车票。【铁路客服】'%(car,man))
if car == 'T298':
    print('您已购%s次列车\t长春到北京\t00:06开\t请%s尽快换取纸质车票。【铁路客服】'%(car,man))
if car == 'Z158':
    print('您已购%s次列车\t长春到北京\t12:48开\t请%s尽快换取纸质车票。【铁路客服】'%(car,man))
if car == 'Z62':
    print('您已购%s次列车\t长春到北京\t21:58开\t请%s尽快换取纸质车票。【铁路客服】'%(car,man))

